{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\palmertm\Documents\all\work\mregger\GitHub\mrrobust\_drafts\save-estimates\save-estimates.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}24 Jan 2020, 15:35:12
{txt}
{com}. //_1
. use https://raw.github.com/remlapmot/mrrobust/master/dodata, clear
{txt}
{com}. //_2
. gen byte sel1 = (ldlcp2 < 1e-8)
{txt}
{com}. //_3
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, ivw fe

{col 55}{txt}Number of genotypes = {res}73
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}chdbeta      {txt}{c |}
{space 4}ldlcbeta {c |}{col 14}{res}{space 2} .4815055{col 26}{space 2}  .038221{col 37}{space 1}   12.60{col 46}{space 3}0.000{col 54}{space 4} .4065938{col 67}{space 3} .5564173
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. mat ivw = r(table)
{txt}
{com}. //_4
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1

{col 55}{txt}Number of genotypes = {res}73
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}sign(ldlcb~a){txt}{c |}
{res}chdbeta      {txt}{c |}
{space 7}slope {c |}{col 14}{res}{space 2} .6173131{col 26}{space 2} .1034573{col 37}{space 1}    5.97{col 46}{space 3}0.000{col 54}{space 4} .4145405{col 67}{space 3} .8200858
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0087706{col 26}{space 2} .0054812{col 37}{space 1}   -1.60{col 46}{space 3}0.110{col 54}{space 4}-.0195136{col 67}{space 3} .0019723
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Residual standard error:  1.548

{com}. mat mregger = r(table)
{txt}
{com}. //_5
. mregger chdbeta ldlcbeta [aw=1/(chdse^2)] if sel1==1, radial

{col 55}{txt}Number of genotypes = {res}73
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}radialGD     {txt}{c |}
{space 4}radialGP {c |}{col 14}{res}{space 2}  .642582{col 26}{space 2} .1157871{col 37}{space 1}    5.55{col 46}{space 3}0.000{col 54}{space 4} .4156434{col 67}{space 3} .8695205
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.5737301{col 26}{space 2} .3545658{col 37}{space 1}   -1.62{col 46}{space 3}0.106{col 54}{space 4}-1.268666{col 67}{space 3} .1212062
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Residual standard error:  1.547

{com}. mat radial = r(table)
{txt}
{com}. //_6
. mrmodal chdbeta chdse ldlcbeta ldlcse if sel1==1, weighted
{res}
{col 55}Number of genotypes = 73
{col 60}Replications = 1000
{col 72}Phi = 1
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}beta {c |}{col 14}{res}{space 2} .4789702{col 26}{space 2} .0693217{col 37}{space 1}    6.91{col 46}{space 3}0.000{col 54}{space 4} .3431022{col 67}{space 3} .6148382
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. mat mode = r(table)
{txt}
{com}. //_7
. mrmedian chdbeta chdse ldlcbeta ldlcse if sel1==1, weighted
{res}
{col 55}Number of genotypes = 73
{col 60}Replications = 1000
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}beta {c |}{col 14}{res}{space 2} .4582573{col 26}{space 2} .0634841{col 37}{space 1}    7.22{col 46}{space 3}0.000{col 54}{space 4} .3338308{col 67}{space 3} .5826838
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. mat median = r(table)
{txt}
{com}. //_8
. mat dir
    {res}   median[9,1]
         mode[9,1]
       radial[9,2]
      mregger[9,2]
          ivw[9,1]
       output[7,9]
{txt}
{com}. mat list ivw
{res}
{txt}ivw[9,1]
          chdbeta:
         ldlcbeta
     b {res} .48150551
{txt}    se {res} .03822098
{txt}     z {res} 12.597937
{txt}pvalue {res} 2.167e-36
{txt}    ll {res} .40659377
{txt}    ul {res} .55641726
{txt}    df {res}         .
{txt}  crit {res}  1.959964
{txt} eform {res}         0
{reset}
{com}. mat list mregger
{res}
{txt}mregger[9,2]
         sign(ldlc~a:  sign(ldlc~a:
               slope         _cons
     b {res}    .61731315    -.00877065
{txt}    se {res}    .10345735     .00548118
{txt}     z {res}    5.9668371      -1.60014
{txt}pvalue {res}    2.419e-09     .10956752
{txt}    ll {res}    .41454047    -.01951356
{txt}    ul {res}    .82008582     .00197226
{txt}    df {res}            .             .
{txt}  crit {res}     1.959964      1.959964
{txt} eform {res}            0             0
{reset}
{com}. mat list radial
{res}
{txt}radial[9,2]
          radialGD:   radialGD:
          radialGP       _cons
     b {res}  .64258196  -.57373006
{txt}    se {res}  .11578709   .35456584
{txt}     z {res}  5.5496858    -1.61812
{txt}pvalue {res}  2.862e-08   .10563675
{txt}    ll {res}  .41564344  -1.2686663
{txt}    ul {res}  .86952048   .12120621
{txt}    df {res}          .           .
{txt}  crit {res}   1.959964    1.959964
{txt} eform {res}          0           0
{reset}
{com}. mat list mode
{res}
{txt}mode[9,1]
             beta
     b {res}  .4789702
{txt}    se {res} .06932169
{txt}     z {res} 6.9093843
{txt}pvalue {res} 4.868e-12
{txt}    ll {res} .34310219
{txt}    ul {res} .61483822
{txt}    df {res}         .
{txt}  crit {res}  1.959964
{txt} eform {res}         0
{reset}
{com}. mat list median
{res}
{txt}median[9,1]
             beta
     b {res} .45825733
{txt}    se {res} .06348407
{txt}     z {res} 7.2184621
{txt}pvalue {res} 5.258e-13
{txt}    ll {res} .33383084
{txt}    ul {res} .58268381
{txt}    df {res}         .
{txt}  crit {res}  1.959964
{txt} eform {res}         0
{reset}
{com}. //_9
. mat output = (ivw, mregger, radial, mode, median)
{txt}
{com}. mat colnames output = ivw_beta mregger_beta mregger_cons ///
> radial_beta radial_cons mode_beta median_beta
{txt}
{com}. mat coleq output = "" "" "" "" "" "" ""
{txt}
{com}. mat output = output'
{txt}
{com}. mat li output
{res}
{txt}output[7,9]
                       b          se           z      pvalue          ll          ul          df        crit
    ivw_beta {res}  .48150551   .03822098   12.597937   2.167e-36   .40659377   .55641726           .    1.959964
{txt}mregger_beta {res}  .61731315   .10345735   5.9668371   2.419e-09   .41454047   .82008582           .    1.959964
{txt}mregger_cons {res} -.00877065   .00548118    -1.60014   .10956752  -.01951356   .00197226           .    1.959964
{txt} radial_beta {res}  .64258196   .11578709   5.5496858   2.862e-08   .41564344   .86952048           .    1.959964
{txt} radial_cons {res} -.57373006   .35456584    -1.61812   .10563675  -1.2686663   .12120621           .    1.959964
{txt}   mode_beta {res}   .4789702   .06932169   6.9093843   4.868e-12   .34310219   .61483822           .    1.959964
{txt} median_beta {res}  .45825733   .06348407   7.2184621   5.258e-13   .33383084   .58268381           .    1.959964

{txt}                   eform
    ivw_beta {res}          0
{txt}mregger_beta {res}          0
{txt}mregger_cons {res}          0
{txt} radial_beta {res}          0
{txt} radial_cons {res}          0
{txt}   mode_beta {res}          0
{txt} median_beta {res}          0
{reset}
{com}. //_10
. drop _all
{txt}
{com}. svmat output, names(col)
{txt}number of observations will be reset to 7
Press any key to continue, or Break to abort
{p}
number of observations (_N)  was 0,
now 7
{p_end}

{com}. local rownames : rownames output
{txt}
{com}. di "`rownames'"
{res}ivw_beta mregger_beta mregger_cons radial_beta radial_cons mode_beta median_beta
{txt}
{com}. tokenize `rownames'
{txt}
{com}. gen str15 estimate = ""
{txt}(7 missing values generated)

{com}. forvalues i = 1/7 {c -(}
{txt}  2{com}. replace estimate = "``i''" in `i'
{txt}  3{com}. {c )-}
{txt}(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

{com}. //_11
. list estimate b se z pvalue ll ul, clean noobs
{txt}
    {res}    estimate           b         se          z     pvalue          ll         ul {txt} 
    {res}    ivw_beta    .4815055    .038221   12.59794   2.17e-36    .4065938   .5564172 {txt} 
    {res}mregger_beta    .6173131   .1034573   5.966837   2.42e-09    .4145405   .8200858 {txt} 
    {res}mregger_cons   -.0087707   .0054812   -1.60014   .1095675   -.0195136   .0019723 {txt} 
    {res} radial_beta    .6425819   .1157871   5.549686   2.86e-08    .4156434   .8695205 {txt} 
    {res} radial_cons   -.5737301   .3545658   -1.61812   .1056367   -1.268666   .1212062 {txt} 
    {res}   mode_beta    .4789702   .0693217   6.909384   4.87e-12    .3431022   .6148382 {txt} 
    {res} median_beta    .4582573   .0634841   7.218462   5.26e-13    .3338308   .5826838 {txt} 

{com}. //_12
. save myestimates, replace
{txt}file myestimates.dta saved

{com}. //_13
. export delimited using myestimates.txt, delimiter(tab) replace
{res}{txt}file myestimates.txt saved

{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\palmertm\Documents\all\work\mregger\GitHub\mrrobust\_drafts\save-estimates\save-estimates.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}24 Jan 2020, 15:35:13
{txt}{.-}
{smcl}
{txt}{sf}{ul off}